console.log("============== Practice ================");

// 1,2,3,4,5,6,7,8,9,10

// let summ = 0;

// for (let i = 1; i <= 50; i += 1) {
//   //   console.log(i);
//   summ += i;
// }
// console.log(`Загальна сума всіх чисел віл 1 до 50 буде ${summ}`);

// парні числа від 2 до 20

// for (let i = 2; i <= 20; i += 2) {
//   console.log("i :>> ", i);
// }

// for (let i = 1; i <= 20; i += 1) {
//   //   console.log("i :>> ", i);

//   if (i % 2 === 0) {
//     console.log(i);
//   }
// }

// Напиши цикл, який пропонує в prompt ввести число, більше 100. Якщо відвідувач ввів інше число – попросити ввести ще раз и т.д.

// let num;

// while (true) {
//   num = prompt("Введіть число більше 100");
//   if (num > 100 || num === null) {
//     break;
//   }
//   alert("Спробуй ще!");
// }

// Напиши скрипт який порахує суму всіх парних чисел, які входять в діапазон чисел в змінних від min до max. Наприклад, якщо min=0 и max=5, то діапазон 0-5, і в ньому 2 парних числа - 2 та 4, їх сума 6. Можна зробити отримання значень мінімального і максимального числа через інпут.

const min = 0;
const max = 20;
let sum = 0;

for (let i = min; i <= max; i += 1) {
  if (i % 2 === 0) {
    sum += i;
  }
}
console.log(`Сума парних чисел в діапазоні від ${min} до ${max} : ${sum}`);
